erp3l/src/Catalogs/инт_ПроверкаСоответствияЗагружаемыхПакетовОбменаТекущейБазе/инт_ПроверкаСоответствияЗагружаемыхПакетовОбменаТекущейБазе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>инт_ПроверкаСоответствияЗагружаемыхПакетовОбменаТекущейБазе</name>
  <attributes>
    <name>Активность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗначенияJSON</name>
    <attributes>
      <name>НаименованиеСвойства</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСвойства</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛогическийОператор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛогическоеУсловие</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>16</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Catalogs/инт_ПроверкаСоответствияЗагружаемыхПакетовОбменаТекущейБазе/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если не ЗначениеЗаполнено(Объект.Пользователь) тогда
		Объект.Пользователь=ПараметрыСеанса.ТекущийПользователь;	
	КонецЕсли;	
	
	Если не ЗначениеЗаполнено(Объект.Дата) тогда
		Объект.Дата=ТекущаяДата();	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияHEADПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока тогда
		Элемент.ТекущиеДанные.ЛогическийОператор="=";	
		Элемент.ТекущиеДанные.ЛогическоеУсловие="Условие ""И""";
	КонецЕсли;	
КонецПроцедуры
